<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Pandas" data-toc-modified-id="Pandas-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Pandas</a></span><ul class="toc-item"><li><span><a href="#Attributes" data-toc-modified-id="Attributes-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Attributes</a></span></li><li><span><a href="#Indexation" data-toc-modified-id="Indexation-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Indexation</a></span></li></ul></li><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>DataFrame</a></span><ul class="toc-item"><li><span><a href="#Attributes" data-toc-modified-id="Attributes-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Attributes</a></span></li><li><span><a href="#Indexation" data-toc-modified-id="Indexation-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Indexation</a></span></li></ul></li><li><span><a href="#Import/Export" data-toc-modified-id="Import/Export-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Import/Export</a></span></li></ul></div>

# Pandas

<img src='https://ankane.org/images/daru.jpg'>

In [1]:
import pandas as pd

In [2]:
pd.Series

pandas.core.series.Series

In [3]:
?pd.Series.__init__

In [4]:
l=list(range(-5,50,5))

l

[-5, 0, 5, 10, 15, 20, 25, 30, 35, 40, 45]

In [5]:
pd.Series(l)

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
dtype: int64

In [6]:
list('qwertzuiopa')

['q', 'w', 'e', 'r', 't', 'z', 'u', 'i', 'o', 'p', 'a']

In [7]:
pd.Series(l, index=list('qwertzuiopa'))

q    -5
w     0
e     5
r    10
t    15
z    20
u    25
i    30
o    35
p    40
a    45
dtype: int64

In [8]:
pd.Series('qwertzuiopa')

0    qwertzuiopa
dtype: object

In [9]:
pd.Series(range(-5,50,5))

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
dtype: int64

In [10]:
pd.Series(range(-5,50,5), name='x5 numbers')

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
Name: x5 numbers, dtype: int64

In [11]:
pd.Series(range(-5,50,5), dtype=float)

0     -5.0
1      0.0
2      5.0
3     10.0
4     15.0
5     20.0
6     25.0
7     30.0
8     35.0
9     40.0
10    45.0
dtype: float64

In [12]:
pd.Series(4)

0    4
dtype: int64

In [13]:
pd.Series({'apples':10,'cucumbers':3, 'bread':2, 'bacon':5, 'water':2}, name='picnic')

apples       10
cucumbers     3
bread         2
bacon         5
water         2
Name: picnic, dtype: int64

In [14]:
pd.Series({'a':[0,1,2,3,4,5],'b':[0,1,4,9,16,25],'c':[-1,-2,-3,-4,-5,-6]})

a          [0, 1, 2, 3, 4, 5]
b        [0, 1, 4, 9, 16, 25]
c    [-1, -2, -3, -4, -5, -6]
dtype: object

In [17]:
pd.Series({'a':[0,1,2,3,4,5],'b':[0,1,4,9,16,25],'c':[-1,-2,-3,-4,-5,-6]})['a']

[0, 1, 2, 3, 4, 5]

In [18]:
s=pd.Series({'apples':10,'cucumbers':3, 'bread':2, 'bacon':5, \
             'water':5, 'sunscreen':1, 'baby wipes':1, 'bug spray':2, \
             'blanket':1, 'beer':10, 'wine':1, 'bottle opener':2, \
             'knife':1, 'towel':2, 'trash bags':5, 'ice packs':2, \
             'camera':1, 'board games':2}, name='picnic')

## Attributes

In [19]:
s.dtype

dtype('int64')

In [20]:
s.hasnans

False

In [21]:
s.index

Index(['apples', 'cucumbers', 'bread', 'bacon', 'water', 'sunscreen',
       'baby wipes', 'bug spray', 'blanket', 'beer', 'wine', 'bottle opener',
       'knife', 'towel', 'trash bags', 'ice packs', 'camera', 'board games'],
      dtype='object')

In [22]:
s

apples           10
cucumbers         3
bread             2
bacon             5
water             5
sunscreen         1
baby wipes        1
bug spray         2
blanket           1
beer             10
wine              1
bottle opener     2
knife             1
towel             2
trash bags        5
ice packs         2
camera            1
board games       2
Name: picnic, dtype: int64

In [23]:
s.values

array([10,  3,  2,  5,  5,  1,  1,  2,  1, 10,  1,  2,  1,  2,  5,  2,  1,
        2])

In [24]:
s.size

18

In [25]:
s.is_monotonic_increasing

False

In [27]:
pd.Series(range(19)).is_monotonic_increasing

True

In [28]:
s.is_monotonic_decreasing

False

In [30]:
pd.Series(list('dcba')).is_monotonic_decreasing

True

In [31]:
s.ndim

1

In [32]:
s.name

'picnic'

In [33]:
s.empty

False

## Indexation

In [37]:
s.head(n=10)

apples        10
cucumbers      3
bread          2
bacon          5
water          5
sunscreen      1
baby wipes     1
bug spray      2
blanket        1
beer          10
Name: picnic, dtype: int64

In [38]:
s.tail(n=10)

blanket           1
beer             10
wine              1
bottle opener     2
knife             1
towel             2
trash bags        5
ice packs         2
camera            1
board games       2
Name: picnic, dtype: int64

In [39]:
s.sample(5)

bug spray        2
towel            2
bottle opener    2
trash bags       5
ice packs        2
Name: picnic, dtype: int64

In [40]:
s['bottle opener']

2

In [41]:
s.camera

1

In [46]:
s[['towel','baby wipes']]

towel         2
baby wipes    1
Name: picnic, dtype: int64

In [47]:
s.loc[['towel','baby wipes']]

towel         2
baby wipes    1
Name: picnic, dtype: int64

In [50]:
s.loc['bread':'beer']

bread          2
bacon          5
water          5
sunscreen      1
baby wipes     1
bug spray      2
blanket        1
beer          10
Name: picnic, dtype: int64

In [53]:
s.iloc[[1]]

cucumbers    3
Name: picnic, dtype: int64

In [52]:
s.iloc[[1,3,9]]

cucumbers     3
bacon         5
beer         10
Name: picnic, dtype: int64

In [54]:
s.iloc[1:9:2]

cucumbers    3
bacon        5
sunscreen    1
bug spray    2
Name: picnic, dtype: int64

In [57]:
list(range(1,9,2))

[1, 3, 5, 7]

# DataFrame

In [58]:
pd.DataFrame

pandas.core.frame.DataFrame

In [60]:
print(pd.DataFrame.__doc__)

    Two-dimensional, size-mutable, potentially heterogeneous tabular data.

    Data structure also contains labeled axes (rows and columns).
    Arithmetic operations align on both row and column labels. Can be
    thought of as a dict-like container for Series objects. The primary
    pandas data structure.

    Parameters
    ----------
    data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
        Dict can contain Series, arrays, constants, or list-like objects.

        .. versionchanged:: 0.23.0
           If data is a dict, column order follows insertion-order for
           Python 3.6 and later.

        .. versionchanged:: 0.25.0
           If data is a list of dicts, column order follows insertion-order
           for Python 3.6 and later.

    index : Index or array-like
        Index to use for resulting frame. Will default to RangeIndex if
        no indexing information part of input data and no index provided.
    columns : Index or array-like
        Column labels to use for resulting frame. Will default to
        RangeIndex (0, 1, 2, ..., n) if no column labels are provided.
    dtype : dtype, default None
        Data type to force. Only a single dtype is allowed. If None, infer.
    copy : bool, default False
        Copy data from inputs. Only affects DataFrame / 2d ndarray input.

    See Also
    --------
    DataFrame.from_records : Constructor from tuples, also record arrays.
    DataFrame.from_dict : From dicts of Series, arrays, or dicts.
    read_csv
    read_table
    read_clipboard

    Examples
    --------
    Constructing DataFrame from a dictionary.

    >>> d = {'col1': [1, 2], 'col2': [3, 4]}
    >>> df = pd.DataFrame(data=d)
    >>> df
       col1  col2
    0     1     3
    1     2     4

    Notice that the inferred dtype is int64.

    >>> df.dtypes
    col1    int64
    col2    int64
    dtype: object

    To enforce a single dtype:

    >>> df = pd.DataFrame(data=d, dtype=np.int8)
    >>> df.dtypes
    col1    int8
    col2    int8
    dtype: object

    Constructing DataFrame from numpy ndarray:

    >>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
    ...                    columns=['a', 'b', 'c'])
    >>> df2
       a  b  c
    0  1  2  3
    1  4  5  6
    2  7  8  9

In [61]:
l=list(range(-5,50,5))

In [62]:
pd.DataFrame(l)

     0
0   -5
1    0
2    5
3   10
4   15
5   20
6   25
7   30
8   35
9   40
10  45

In [63]:
pd.DataFrame(range(-5,50,5))

     0
0   -5
1    0
2    5
3   10
4   15
5   20
6   25
7   30
8   35
9   40
10  45

In [64]:
pd.DataFrame(range(-5,50,5), columns=['col1'])

    col1
0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45

In [65]:
ll=[[i for i in range(j,j+5)] for j in range(10)]

ll

[[0, 1, 2, 3, 4],
 [1, 2, 3, 4, 5],
 [2, 3, 4, 5, 6],
 [3, 4, 5, 6, 7],
 [4, 5, 6, 7, 8],
 [5, 6, 7, 8, 9],
 [6, 7, 8, 9, 10],
 [7, 8, 9, 10, 11],
 [8, 9, 10, 11, 12],
 [9, 10, 11, 12, 13]]

In [66]:
pd.DataFrame(ll)

   0   1   2   3   4
0  0   1   2   3   4
1  1   2   3   4   5
2  2   3   4   5   6
3  3   4   5   6   7
4  4   5   6   7   8
5  5   6   7   8   9
6  6   7   8   9  10
7  7   8   9  10  11
8  8   9  10  11  12
9  9  10  11  12  13

In [67]:
pd.Series({'a':[0,1,2,3,4,5],'b':[0,1,4,9,16,25],'c':[-1,-2,-3,-4,-5,-6]})

a          [0, 1, 2, 3, 4, 5]
b        [0, 1, 4, 9, 16, 25]
c    [-1, -2, -3, -4, -5, -6]
dtype: object

In [68]:
pd.DataFrame({'a':[0,1,2,3,4,5],'b':[0,1,4,9,16,25],'c':[-1,-2,-3,-4,-5,-6]})

   a   b  c
0  0   0 -1
1  1   1 -2
2  2   4 -3
3  3   9 -4
4  4  16 -5
5  5  25 -6

In [70]:
colnames = ['LotSize','Neighborhood','YearBuilt','Quality','SalePrice']


house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 118000],
              'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
              'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
              'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
              'James House': [11250, 'CollgCr', 2001, 7, 223500],
              'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
              'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
              'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
              'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
              'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

display(pd.DataFrame(house_dict))

,Baker House,Beazley House,Dominguez House,Hamilton House,James House,Martinez House,Roberts House,Smith House,Snyder House,Zuckerman House
0,7420,14115,14260,6120,11250,9600,9550,8450,10084,10382
1,BrkSide,Mitchel,NoRidge,OldTown,CollgCr,Veenker,Crawfor,CollgCr,Somerst,NWAmes
2,1939,1993,2000,1931,2001,1976,1915,2003,2004,1973
3,5,5,8,7,7,6,7,7,8,7
4,118000,143000,250000,129900,223500,181500,140000,208500,307000,200000

In [72]:
pd.DataFrame(house_dict).transpose()

                     0        1     2  3       4
Baker House       7420  BrkSide  1939  5  118000
Beazley House    14115  Mitchel  1993  5  143000
Dominguez House  14260  NoRidge  2000  8  250000
Hamilton House    6120  OldTown  1931  7  129900
James House      11250  CollgCr  2001  7  223500
Martinez House    9600  Veenker  1976  6  181500
Roberts House     9550  Crawfor  1915  7  140000
Smith House       8450  CollgCr  2003  7  208500
Snyder House     10084  Somerst  2004  8  307000
Zuckerman House  10382   NWAmes  1973  7  200000

In [76]:
pd.DataFrame(house_dict, index=colnames).T

                LotSize Neighborhood YearBuilt Quality SalePrice
Baker House        7420      BrkSide      1939       5    118000
Beazley House     14115      Mitchel      1993       5    143000
Dominguez House   14260      NoRidge      2000       8    250000
Hamilton House     6120      OldTown      1931       7    129900
James House       11250      CollgCr      2001       7    223500
Martinez House     9600      Veenker      1976       6    181500
Roberts House      9550      Crawfor      1915       7    140000
Smith House        8450      CollgCr      2003       7    208500
Snyder House      10084      Somerst      2004       8    307000
Zuckerman House   10382       NWAmes      1973       7    200000

In [80]:
pd.DataFrame.from_dict(house_dict, orient='index', columns=colnames)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [81]:
df=pd.DataFrame.from_dict(house_dict, orient='index', columns=colnames)

In [82]:
df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

## Attributes

In [83]:
df.dtypes

LotSize          int64
Neighborhood    object
YearBuilt        int64
Quality          int64
SalePrice        int64
dtype: object

In [84]:
df.index

Index(['Baker House', 'Beazley House', 'Dominguez House', 'Hamilton House',
       'James House', 'Martinez House', 'Roberts House', 'Smith House',
       'Snyder House', 'Zuckerman House'],
      dtype='object')

In [85]:
df.columns

Index(['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice'], dtype='object')

In [86]:
df.values

array([[7420, 'BrkSide', 1939, 5, 118000],
       [14115, 'Mitchel', 1993, 5, 143000],
       [14260, 'NoRidge', 2000, 8, 250000],
       [6120, 'OldTown', 1931, 7, 129900],
       [11250, 'CollgCr', 2001, 7, 223500],
       [9600, 'Veenker', 1976, 6, 181500],
       [9550, 'Crawfor', 1915, 7, 140000],
       [8450, 'CollgCr', 2003, 7, 208500],
       [10084, 'Somerst', 2004, 8, 307000],
       [10382, 'NWAmes', 1973, 7, 200000]], dtype=object)

In [87]:
df.shape

(10, 5)

In [88]:
df.size

50

In [89]:
df.ndim

2

## Indexation

In [90]:
df.head(4)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900

In [91]:
df.tail(3)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [92]:
df.sample(4)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Smith House         8450      CollgCr       2003        7     208500
Roberts House       9550      Crawfor       1915        7     140000
Beazley House      14115      Mitchel       1993        5     143000
Zuckerman House    10382       NWAmes       1973        7     200000

In [93]:
df.Quality

Baker House        5
Beazley House      5
Dominguez House    8
Hamilton House     7
James House        7
Martinez House     6
Roberts House      7
Smith House        7
Snyder House       8
Zuckerman House    7
Name: Quality, dtype: int64

In [94]:
df['Quality']

Baker House        5
Beazley House      5
Dominguez House    8
Hamilton House     7
James House        7
Martinez House     6
Roberts House      7
Smith House        7
Snyder House       8
Zuckerman House    7
Name: Quality, dtype: int64

In [95]:
df[['Quality','SalePrice']]

                 Quality  SalePrice
Baker House            5     118000
Beazley House          5     143000
Dominguez House        8     250000
Hamilton House         7     129900
James House            7     223500
Martinez House         6     181500
Roberts House          7     140000
Smith House            7     208500
Snyder House           8     307000
Zuckerman House        7     200000

In [96]:
df.loc['Beazley House']

LotSize           14115
Neighborhood    Mitchel
YearBuilt          1993
Quality               5
SalePrice        143000
Name: Beazley House, dtype: object

In [97]:
df.loc[['Beazley House','Snyder House']]

               LotSize Neighborhood  YearBuilt  Quality  SalePrice
Beazley House    14115      Mitchel       1993        5     143000
Snyder House     10084      Somerst       2004        8     307000

In [98]:
df.loc[['Beazley House','Snyder House'], 'Quality']

Beazley House    5
Snyder House     8
Name: Quality, dtype: int64

In [99]:
df.loc[['Beazley House','Snyder House'], ['Quality','SalePrice']]

               Quality  SalePrice
Beazley House        5     143000
Snyder House         8     307000

In [100]:
df.loc['Beazley House':'Martinez House']

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500

In [102]:
df.loc['Beazley House':'Martinez House', 'LotSize':'YearBuilt']

                 LotSize Neighborhood  YearBuilt
Beazley House      14115      Mitchel       1993
Dominguez House    14260      NoRidge       2000
Hamilton House      6120      OldTown       1931
James House        11250      CollgCr       2001
Martinez House      9600      Veenker       1976

In [103]:
df.loc[:, 'LotSize':'YearBuilt']

                 LotSize Neighborhood  YearBuilt
Baker House         7420      BrkSide       1939
Beazley House      14115      Mitchel       1993
Dominguez House    14260      NoRidge       2000
Hamilton House      6120      OldTown       1931
James House        11250      CollgCr       2001
Martinez House      9600      Veenker       1976
Roberts House       9550      Crawfor       1915
Smith House         8450      CollgCr       2003
Snyder House       10084      Somerst       2004
Zuckerman House    10382       NWAmes       1973

In [104]:
df.iloc[1]

LotSize           14115
Neighborhood    Mitchel
YearBuilt          1993
Quality               5
SalePrice        143000
Name: Beazley House, dtype: object

In [106]:
df.iloc[1:-1]

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000

In [107]:
df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [108]:
df.iloc[[1,-2],[0,-2]]

               LotSize  Quality
Beazley House    14115        5
Snyder House     10084        8

# Import/Export

In [109]:
import os

In [110]:
os.chdir('/home/mauritian/Downloads/vehicles/')

In [112]:
os.listdir()

['vehicles.xlsx',
 'vehicles.csv',
 'vehicles_pipe.txt',
 'vehicles_messy.csv',
 'vehicles.json',
 'vehicles_tab.txt']

In [115]:
pd.read_csv('vehicles.csv').head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [117]:
pd.read_csv('vehicles_tab.txt', sep='\t').head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [118]:
pd.read_csv('vehicles_pipe.txt', sep='|').head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [120]:
pd.read_excel('vehicles.xlsx').head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [125]:
data=pd.read_json('vehicles.json')

In [129]:
data.to_csv('new.csv',sep=';',index=False)

In [130]:
data.to_excel('new.xlsx', index=False)

In [131]:
data.to_json('new.json', orient='split')

In [132]:
!pip install pymysql

Requirement already satisfied: pymysql in /home/mauritian/yes/lib/python3.7/site-packages (0.9.3)

In [133]:
import pymysql
from sqlalchemy import create_engine

In [134]:
username='root'
server='localhost'
database='publications'
password='password'

In [138]:
engine=create_engine(f'mysql+pymysql://{username}:{password}@{server}/{database}')

In [141]:
data=pd.read_sql_query('select * from most_profiting_authors', engine)

In [142]:
data

         au_id title_id  TotalProfits
0  722-51-5454   MC3021     11271.528
1  899-46-2035   MC3021     11257.176
2  213-46-8915   BU2075     10150.116

In [143]:
data.to_sql(name='new_table', con=engine, if_exists='replace',index=False)

In [144]:
from sqlalchemy import inspect

inspector=inspect(engine)

In [145]:
inspector.get_table_names()

['authors',
 'discounts',
 'employee',
 'employee_new',
 'jobs',
 'most_profiting_authors',
 'new_table',
 'pub_info',
 'publishers',
 'roysched',
 'sales',
 'stores',
 'titleauthor',
 'titles']

In [146]:
engine=create_engine(f'mysql+pymysql://{username}:{password}@{server}/finance')

In [147]:
inspector=inspect(engine)
inspector.get_table_names()

['account']

In [148]:
os.getcwd()

'/home/mauritian/Downloads/vehicles'

In [149]:
os.chdir('/media/mauritian/New SSD/Downloads/czech')

In [150]:
os.listdir()

['account.csv',
 'berka.pdf',
 'card.asc',
 'client.asc',
 'disp.asc',
 'district.asc',
 'loan.asc',
 'order.asc',
 'trans.asc']

In [152]:
toopen=[i for i in os.listdir() if i.endswith('csv') or i.endswith('asc')]

In [155]:
dct={i[:-4]: pd.read_csv(i, sep=';') for i in toopen}

/home/mauritian/yes/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3254: DtypeWarning: Columns (8) have mixed types.Specify dtype option on import or set low_memory=False.
  if (await self.run_code(code, result,  async_=asy)):

In [157]:
dct.keys()

dict_keys(['account', 'card', 'client', 'disp', 'district', 'loan', 'order', 'trans'])

In [158]:
dct['client']

      client_id  birth_number  district_id
0             1        706213           18
1             2        450204            1
2             3        406009            1
3             4        561201            5
4             5        605703            5
...         ...           ...          ...
5364      13955        456030            1
5365      13956        430406            1
5366      13968        680413           61
5367      13971        626019           67
5368      13998        535812           74

[5369 rows x 3 columns]

In [ ]:
for i,j in dct.items():
    j.to_sql(i, con=engine, if_exists='replace',index=False)

In [1]:
import pandas as pd

In [2]:
?pd.DataFrame.to_sql